peanutwolf/IEC104toUVTK-converter/Utilities/STM32_EVAL/STM324x7I_EVAL/stm324x7i_eval — копия.c
	  RCC_APB1PeriphClockCmd(RCC_APB1Periph_PWR, ENABLE);
 
    PWR_BackupAccessCmd(ENABLE);
 
    RCC_BackupResetCmd(ENABLE);
    RCC_BackupResetCmd(DISABLE);

    RCC_RTCCLKConfig(RCC_RTCCLKSource_HSE_Div8);
    RCC_RTCCLKCmd(ENABLE);
	 
    rtc_def.RTC_HourFormat = RTC_HourFormat_24;
    rtc_def.RTC_SynchPrediv = 0x1F3F;  //0x03E7
	  rtc_def.RTC_AsynchPrediv = 0x7C;
	  
    RTC_Init(&rtc_def);
}

/**
  * @brief  Initializes SPI to send data to UVTK
  * @param  None
  * @retval None
  */ 

void Init_SPI(void){
	
	GPIO_InitTypeDef GPIO_InitStruct;
	SPI_InitTypeDef SPI_InitStruct;
	
	RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOC, ENABLE);
	
	GPIO_InitStruct.GPIO_Pin = GPIO_Pin_10 | GPIO_Pin_11 | GPIO_Pin_12;
	GPIO_InitStruct.GPIO_Mode = GPIO_Mode_AF;
	GPIO_InitStruct.GPIO_OType = GPIO_OType_PP;
	GPIO_InitStruct.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_InitStruct.GPIO_PuPd = GPIO_PuPd_NOPULL;
	GPIO_Init(GPIOC, &GPIO_InitStruct);

	GPIO_PinAFConfig(GPIOC, GPIO_PinSource10, GPIO_AF_SPI3);
	GPIO_PinAFConfig(GPIOC, GPIO_PinSource11, GPIO_AF_SPI3);
	GPIO_PinAFConfig(GPIOC, GPIO_PinSource12, GPIO_AF_SPI3);
	
	RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOA, ENABLE);
	
	GPIO_InitStruct.GPIO_Pin = GPIO_Pin_15;
	GPIO_InitStruct.GPIO_Mode = GPIO_Mode_OUT;
	GPIO_InitStruct.GPIO_OType = GPIO_OType_PP;
	GPIO_InitStruct.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_InitStruct.GPIO_PuPd = GPIO_PuPd_NOPULL;
	GPIO_Init(GPIOA, &GPIO_InitStruct);
	
	RCC_APB1PeriphClockCmd(RCC_APB1Periph_SPI3, ENABLE);
	
	SPI_InitStruct.SPI_Direction = SPI_Direction_2Lines_FullDuplex;
	SPI_InitStruct.SPI_Mode = SPI_Mode_Master;  
	SPI_InitStruct.SPI_DataSize = SPI_DataSize_8b; 
	SPI_InitStruct.SPI_CPOL = SPI_CPOL_Low; 
	SPI_InitStruct.SPI_CPHA = SPI_CPHA_2Edge;    
	SPI_InitStruct.SPI_NSS = SPI_NSS_Soft | SPI_NSSInternalSoft_Set; 
	SPI_InitStruct.SPI_BaudRatePrescaler = SPI_BaudRatePrescaler_256; 
	SPI_InitStruct.SPI_FirstBit = SPI_FirstBit_MSB;
	SPI_Init(SPI3, &SPI_InitStruct); 
	
	SPI_Cmd(SPI3, ENABLE); // enable SPI3
	
	SPI_I2S_ITConfig(SPI3, SPI_I2S_IT_RXNE, ENABLE);
	
	NVIC_InitStructure.NVIC_IRQChannel = SPI3_IRQn;
  NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 0x0F;
  NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0x0F;
  NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
  NVIC_Init(&NVIC_InitStructure);
	
}


/**
  * @brief  Sends array to SPIx (to UVTK)
	* @param  SPIx: Number of SPI device
	* @param  data: Pointer to array to be send to UVTK
	* @param  size: size of array
  * @retval None
  */ 
void SPI_SendDataArray(SPI_TypeDef* SPIx, const uint8_t* data, uint8_t size){
	uint8_t i = 0;
	for(i = 0; i < size; i++){
		while(SPI_I2S_GetFlagStatus(SPI3, SPI_I2S_FLAG_BSY) == SET){};
				printf("sending %d\n", data[i]);
				SPI_I2S_SendData(SPIx, data[i]);
			  xSemaphoreTake(xSPI_UVTK_Semaphore, portMAX_DELAY);
			  vTaskDelay(SPI_UVTK_DELAY);
	}
}

void Init_IWDT(void){
 IWDG_WriteAccessCmd(IWDG_WriteAccess_Enable);
 IWDG_SetPrescaler(IWDG_Prescaler_64);
 IWDG_SetReload(0x0FFF);
 IWDG_Enable();
}

/**
  * @}
  */

/**
  * @}
  */    

/**
  * @}
  */ 
    
/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
